app/controllers/orders_controller.rb

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Mon, 14 Apr 2014 22:05:28 UTC +00:00], ["updated_at", Mon, 14 Apr 2014 22:05:28 UTC +00:00]]
INSERT INTO "orders" ("address", "created_at", "email", "name", "pay_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 980190963]]
---
  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(@cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])