app/controllers/users_controller.rb

  def index
    @users = User.order(:name)
---
SELECT "users".* FROM "users" ORDER BY "users".name ASC

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?)

  def destroy
    begin
      @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 980190962]]